Repository: MyLittleSuite/flutter_essentials_kit
Catalog: lib/localizations/flutter_essentials_kit_*.arb
Languages: de, es, fr, it

# ruleConfirmed
source: This field must be confirmed
de: Feld muss bestätigt werden
es: Campo por confirmar
fr: Champ à confirmer
it: Campo da confermare

# ruleEmail
source: This email seems to be not valid
de: Diese E-Mail scheint nicht gültig zu sein
es: Este correo electrónico no parece ser válido
fr: Cet email ne semble pas valide
it: Questa email non sembra valida

# ruleMaxStringLength
source: {max, plural, =1{The text length can't be greater than {max} character} other{The text length can't be greater than {max} characters}}
de: {max, plural, =1{Die Länge des Textes darf nicht länger als {max} Zeichen sein} other{Die Länge des Textes darf nicht länger als {max} Zeichen sein}}
es: {max, plural, =1{La longitud del texto no puede ser superior a {max} carácter} other{La longitud del texto no puede ser superior a {max} caracteres}}
fr: {max, plural, =1{La longueur du texte ne peut pas être supérieure à {max} caractère} other{La longueur du texte ne peut pas dépasser {max} caractères}}
it: {max, plural, =1{La lunghezza del testo non può essere maggiore di {max} carattere} other{La lunghezza del testo non può essere maggiore di {max} caratteri}}

# ruleMaxNumber
source: {max, plural, other{The number can't be greater than {max}}}
de: {max, plural, other{Der Wert der Zahl darf nicht größer als {max} sein}}
es: {max, plural, other{El valor numérico no puede ser mayor que {max}}}
fr: {max, plural, other{La valeur du nombre ne peut pas être supérieure à {max}}}
it: {max, plural, other{Il valore del numero non può essere maggiore di {max}}}

# ruleMaxListLength
source: {max, plural, other{The list length can't be greater than {max}}}
de: {max, plural, other{Die Größe der Liste darf nicht größer als {max} sein}}
es: {max, plural, other{El tamaño de la lista no puede ser superior a {max}}}
fr: {max, plural, other{La taille de la liste ne peut pas être supérieure à {max}}}
it: {max, plural, other{La dimensione della lista non può essere maggiore di {max}}}

# ruleMinStringLength
source: {min, plural, =1{The text length can't be less than {min} character} other{The text length can't be less than {min} characters}}
de: {min, plural, =1{Die Länge des Textes darf nicht weniger als {min} Zeichen betragen} other{Die Länge des Textes darf nicht weniger als {min} Zeichen betragen}}
es: {min, plural, =1{La longitud del texto no puede ser inferior a {min} carácter} other{La longitud del texto no puede ser inferior a {min} caracteres}}
fr: {min, plural, =1{La longueur du texte ne peut pas être inférieure à {min} caractère} other{La longueur du texte ne peut pas être inférieure à {min} caractères}}
it: {min, plural, =1{La lunghezza del testo non può essere minore di {min} carattere} other{La lunghezza del testo non può essere minore di {min} caratteri}}

# ruleMinNumber
source: {min, plural, other{The number can't be less than {min}}}
de: {min, plural, other{Der Wert der Zahl darf nicht kleiner als {min} sein}}
es: {min, plural, other{El valor numérico no puede ser inferior a {min}}}
fr: {min, plural, other{La valeur du nombre ne peut pas être inférieure à {min}}}
it: {min, plural, other{Il valore del numero non può essere minore di {min}}}

# ruleMinListLength
source: {min, plural, other{The list length can't be less than {min}}}
de: {min, plural, other{Die Größe der Liste darf nicht kleiner als {min} sein}}
es: {min, plural, other{El tamaño de la lista no puede ser inferior a {min}}}
fr: {min, plural, other{La taille de la liste ne peut pas être inférieure à {min}}}
it: {min, plural, other{La dimensione della lista non può essere minore di {min}}}

# ruleRegex
source: This value is not valid
de: Die Daten sind ungültig
es: El elemento de datos no es válido
fr: Les données ne sont pas valides
it: Il dato non è valido

# ruleRequired
source: This field is required
de: Dieses Feld wird benötigt
es: Este campo es obligatorio
fr: Ce champ est requis
it: Questo campo è richiesto

# ruleSame
source: The fields are not the same
de: Die Felder stimmen nicht überein
es: Los campos no coinciden
fr: Les champs ne correspondent pas
it: I campi non corrispondono

# ruleSizeStringLength
source: {size, plural, =1{The text length must be {size} character} other{The text length must be {size} characters}}
de: {size, plural, =1{Die Länge des Textes muss {size} Zeichen sein} other{Die Länge des Textes muss {size} Zeichen betragen}}
es: {size, plural, =1{La longitud del texto debe ser {size} carácter} other{La longitud del texto debe ser {size} caracteres}}
fr: {size, plural, =1{La longueur du texte doit être de {size} caractère} other{La longueur du texte doit être de {size} caractères}}
it: {size, plural, =1{La lunghezza del testo deve essere di {size} carattere} other{La lunghezza del testo deve essere di {size} caratteri}}

# ruleSizeNumber
source: {size, plural, other{The number must be {size}}}
de: {size, plural, other{Der Zahlenwert muss {size} sein}}
es: {size, plural, other{El valor numérico debe ser {size} caracteres}}
fr: {size, plural, other{La valeur numérique doit être {size}}}
it: {size, plural, other{Il valore del numero deve essere {size}}}

# ruleSizeListLength
source: {size, plural, other{The list length must be {size}}}
de: {size, plural, other{Die Größe der Liste muss {size} sein}}
es: {size, plural, other{El tamaño de la lista debe ser {size}}}
fr: {size, plural, other{La taille de la liste doit être de {size}}}
it: {size, plural, other{La dimensione della lista deve essere di {size}}}
